GAero/OF/tempCase/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
  INLET
  //{
  //    type  fixedValue;
  //    value $internalField;
  //}
  {
      type            inletOutlet;
      inletValue      $internalField;
      value           $internalField;
  }
  OUTLET
  {
      type            inletOutlet;
      inletValue      $internalField;
      value           $internalField;
  }
  PROFILE
  {
      type            omegaWallFunction;
      value           $internalField;
  }
  #include "include/emptyPatches"
}


// ************************************************************************* //
